<script>
</script>

─ │ ┌ ┐ ┘ └ ├ ┬ ┤ ┴ │ ┼
<!-- 
* 자바스크립트 데이타의 불변성
메모리
┌───────────┬───────────┬───────────┐
│	 1		│	2		│	3		│
└───────────┴───────────┴───────────┘

a = 1 : a는 1번 메모리 주소를 참조 
b = a : b는 a의 메모리 주소를 참조 
a = 2 : a는 2번 메모리 주소를 참조 
b = 3 : b는 3번 메모리 주소를 참조 
1번은 참조하는 값이 없어지므로 가비지 컬렉션이 메모리를 지워주게 된다


* 자바스크립트 데이타의 가변성
┌───────────┬───────────┬───────────┐
│	 1		│	2		│	3		│
└───────────┴───────────┴───────────┘

a = {k:1} : a는 1번 메모리 주소를 참조 
b = a : b는 a의 메모리 주소를 참조 
a.k = 2 : 1번 메모리 값이 {k:2} 로 바뀜. b 도 {k:2} 로 바뀜


* 자바스크립트 데이타의 복사
┌───────────┬───────────┬───────────┐
│	 1		│	2		│	3		│
└───────────┴───────────┴───────────┘

a = {k:1} : a는 1번 메모리 주소를 참조 
b = {...a} : b는 2의 메모리 주소를 참조 
a.k = 2 : 1번 메모리 값이 {k:2} 로 바뀜. 
하지만 b는 2번 메모리를 바라보므로  {k:1} 유지


* 자바스크립트의 얉은 복사 ? 깊은 복사 ?

a = { k:1, o:{p:2} }
b = {...a}
a.k = 2 
a.k = 2 이지만 b.k = 1 로 나타남
a.o.p = 7 
a.o.p = 7 로 바뀌고 b.o.p = 7 로 바뀜



 -->
